---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetVCurveTangentAtStation(System.Double)
source: html/b87ca7b9-d460-45c7-86b4-ff0d08c19ab5.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetVCurveTangentAtStation Method

Calculate 2d (X and Y components of returned vector) vertical tangent at given station.

## Syntax (C#)
```csharp
public XYZ GetVCurveTangentAtStation(
	double station
)
```

## Parameters
- **station** (`System.Double`) - Alignment station to calculate 2d vertical tangent for, in Revit internal model units (standard Imperial feet).

## Returns
2d (X and Y components of returned vector) vertical tangent at given station.